
##########################################
# TODO задание 1
##########################################
"""Выведите 5тый элемент списка"""
print("Результат задания 1")
l = [6, 2, 5, 6, 2, 1, 9]
print(l[4])


##########################################
# конец задания
##########################################

##########################################
# TODO задание 2
##########################################
"""Замените предпоследний элемент списка на 10"""
print("Результат задания 2")
l = [6, 2, 5, 6, 2, 1, 9]
l[len(l)-2]=10

print("Список после изменения", l)
##########################################
# конец задания
##########################################

##########################################
# TODO задание 3
##########################################
"""Уменьшите первый элемент в 3 раза"""
print("Результат задания 3")
l = [6, 2, 5, 6, 2, 1, 9]
l[0]=l[0]//3

print("Список после изменения", l)
##########################################
# конец задания
##########################################

##########################################
# TODO задание 4
##########################################
"""Возвести каждый элемент во вторую степень"""
print("Результат задания 4")
l = [9, 3, 6, 2, 4, 6, 2, 4, 5, 3, 2, 4, 6]
for i in range(len(l)):
    l[i]=l[i]**2

print("Список после изменения", l)
##########################################
# конец задания
##########################################

##########################################
# TODO задание 5
##########################################
"""Вычесть из каждого элемента результат 
выражения 32/5"""
print("Результат задания 5")
l = [9, 3, 6, 2, 4, 6, 2, 4, 5, 3, 2, 4, 6]
a = 32/5
for i in range(len(l)):
    l[i] = round(l[i]-a, 1)

print("Список после изменения", l)
##########################################
# конец задания
##########################################

##########################################
# TODO задание 6
##########################################
"""Прибить к первым 5-ти элементам 16"""
print("Результат задания 6")
l = [9, 3, 6, 2, 4, 6, 2, 4, 5, 3, 2, 4, 6]
for i in range(5):
    l[i]=l[i]+16

print("Список после изменения", l)

##########################################
# конец задания
##########################################

##########################################
# TODO задание 7
##########################################
"""Возвести в степень самого себя (a**a)
числа с индексами от 7 до 11"""
print("Результат задания 7")
l = [9, 3, 6, 2, 4, 6, 2, 4, 5, 3, 2, 4, 6]
for i in range(7,12):
    l[i]=l[i]**l[i]

print("Список после изменения", l)

##########################################
# конец задания
##########################################