
##########################################
# TODO задание 1
##########################################
"""Переделать приведенный for"""
print("Результат задания 1 - списки должны совпасть!")
l = []
for i in range(3, 23, 2):
    l.append(i)

new_l=[]
new_l = [i for i in range(3, 23, 2)]


print(new_l)
print(l)
print(new_l == l)

##########################################
# конец задания
##########################################

##########################################
# TODO задание 2
##########################################
"""Переделать приведенный for"""
print("Результат задания 2 - списки должны совпасть!")
l = []
for i in range(12):
    l.append(2**i + 1)

new_l=[]
new_l = [2**i+1 for i in range(12)]


print(new_l)
print(l)
print(new_l == l)

##########################################
# конец задания
##########################################

##########################################
# TODO задание 3
##########################################
"""Переделать приведенный for"""
print("Результат задания 3 - списки должны совпасть!")
old_l = [1, 3, 1, 3, 5, 2, 5, 6]
l = []
for i in old_l:
    l.append(i-16)

new_l = []
new_l=[i-16 for i in old_l]

print(new_l)
print(l)
print(new_l == l)

##########################################
# конец задания
##########################################

##########################################
# TODO задание 4
##########################################
"""Переделать приведенный for"""
print("Результат задания 4 - списки должны совпасть!")
old_l = [1, 3, 1, 3, 5, 2, 5, 6]
l = []
for i in old_l:
    l.append(13)

new_l = []
new_l = [13 for _ in old_l]

print(new_l)
print(l)
print(new_l == l)

##########################################
# конец задания
##########################################

"""
Переделывать в генератор списков из существующего for
проще, чем писать свои генераторы с нуля, но и это
тоже возможно, потренируемся
"""

##########################################
# TODO задание 5
##########################################
"""Напишите генератор, создающий список,
состоящих из 2оек"""
print("Результат задания 5.1")

# здесь ваш код
l = [2 for _ in range(10)]

print(l)

##########################################
# конец задания
##########################################

##########################################
# TODO задание 5
##########################################
"""Напишите генератор, создающий список,
состоящих из чисел кратных 5
[5,10,15,20,25,30]"""
print("Результат задания 5.2")

# здесь ваш код
l = [i for i in range(5, 36, 5)]

print(l)

##########################################
# конец задания
##########################################

##########################################
# TODO задание 6
##########################################
"""СОздайте список состоящий из степенй двойки"""
print("Результат задания 6")

# здесь ваш код
l = [2**i for i in range(10)]

print(l)

##########################################
# конец задания
##########################################