# дз 4 группа циклы

######################################
# TODO задание 1
#####################################
"""
напишите for, который выведет
каждую букву из строки st (задана мной далее)
в новую строку
примерно так:
о
т
л
и
ч
н
а
я

с
т
р
о
к
а
"""
print("Результат задания 1")
st = "отличная строка"
for i in st:
    print(i)

#################################
# конец задания
#################################

########################################
# TODO задание 2
########################################
"""
напиишите for, который выводит числа 
от 7 до 23"""
print("Результат задания 2")
for i in range(7, 24):
    print(i)

########################################
# конец задания
########################################

########################################
# TODO задание 3
########################################
"""
напиишите for, который выводит числа 
от 100 до 10 с шагом 10
100
90
80
70
60
50
40
30
20
10
"""
print("Результат задания 3")
for i in range(100, 0, -10):
    print(i)

########################################
# конец задания
########################################

########################################
# TODO задание 4
########################################
"""
напиишите for, который выводит числа 
от числа от 0 до 43
"""
print("Результат задания 4")
for i in range(44):
    print(i)

########################################
# конец задания
########################################

########################################
# TODO задание 5
########################################
"""
напиишите for, который выводит числа 
от нечетные числа от 1 до 35 
(подумайте о шаге для нечетных чисел)
"""
print("Результат задания 5")
for i in range(1, 36, 2):
    print(i)

########################################
# конец задания
########################################

