
##########################################
# TODO задание 1
##########################################
"""Напищите код, изображающий фигуру
======
 =====
  ====
   ===
    ==
     =
     """
print("Результат задания 1")

for i in range(6, 0, -1):
    print((7-i)*" " + i*"=")


##########################################
# конец задания
##########################################

##########################################
# TODO задание 2
##########################################
"""Напищите код, изображающий фигуру
    =    
   ===   
  =====  
 =======
=========
(подумайте о том, из сокольки частей состоит фигура,
например x*" " + y*"=" + z * " ")
     """
print("Результат задания 2")

p=1
for i in range(4,-1,-1):
    print(i*" " + p*"=" + i*" ")
    p+=2


##########################################
# конец задания
##########################################


##########################################
# TODO задание 3
##########################################
"""Напищите код, изображающий фигуру
=========
 =======
  =====  
   ===
    =
     """
print("Результат задания 3")

p=9
for i in range(0, 5):
    print(i*" " + p*"=" + i*" ")
    p-=2

##########################################
# конец задания
##########################################


##########################################
# TODO задание 4 дополнительное
##########################################
"""Напищите код, любую красивую фигуру по
вашему желанию
     """
print("Результат задания 4")

p=1
for i in range(4,-1,-1):
    print(i*" " + p*"*" + i*" ")
    p+=2
p=7
for i in range(1, 5):
    print(i*" " + p*"*" + i*" ")
    p-=2

##########################################
# конец задания
##########################################